{
    "game_info": {
        "name": "Counter-Strike",
        "author": "Iskakov A.",
        "version": "1.6"
    },
    "game": {
			"respawn" : {
				"DESCRIPTION" : "Карта de_dust_2, ваша команда на турнире обыгрывает тир 1 команду мира со счетом 15:14, игра до 30 раундов.\nВаша команда очень вымоталась и в случае ничьи не сможет обыграть противников на доп. раундах.\nВам предстоит сыграть один раунд в напряженный обстановке, где все будет зависеть только от ваших навыков и выборов.\nЧто ж, могу пожелать вам только удачи в этой игре, ошибок она прощать не будет.\n\nРаунд начинается со всеми живыми игроками на старке в классическом формате 5v5.\nДвое ваших тиммейтов пошли на точке А, один встал мид и один ушел на точку Б через 'MIDDLE'.\nК кому вы пойдете в первую очередь?",
				"ACTIONS" : [
					{
						"NAME"   : "точка А",
						"EFFECT" : {
							"GO" : "a-plant"
						}
					},
					{
						"NAME"   : "мид",
						"EFFECT" : {
							"GO" : "middle"
						}
					},
					{
						"NAME"   : "купить гранаты",
						"WHEN"   : {
							"LACK"   : "grenades"
						},
						"EFFECT" : {
							"COLLECT" : "grenades",
							"ALERT"   : "Вы купили дымовую, световую и осколочные гранаты... Разумно!"
						}
					}
				]
        	},
            "a-site" : {
				"DESCRIPTION" : "И так, вы направились на точку А, оба ваших друга пошли на позицию 'LONG', но оставили позицию 'SHORT' открытой.\nЕсли ничего не предпринять, противники смогут пройти к вам в спину и зажать вас!\n\nКуда пойдете вы?",
				"ACTIONS" : [
					{
						"NAME"   : "LONG",
						"EFFECT" : {
							"GO" : "long"
						}
					},
					{
						"NAME"   : "SHORT",
						"EFFECT" : {
							"GO" : "short"
						}
					},
					{
						"NAME"   : "MIDDLE",
						"EFFECT" : {
							"GO" : "middle"
						}
					}
				]
			},
			"short" : {
				"DESCRIPTION" : "Вы на позиции 'SHORT', у вас полная тишина, возможно противники задумали что-то...\nВы слышите по голосовой связи, что противники вышли и задавили количеством ваших союзников на позиции 'LONG'. К счастью, минимальный размен удался. \n\nСитуация 3v4.\n\nЧто вы сделаете?",
				"ACTIONS" : [
					{
						"NAME"   : "точка А",
						"EFFECT" : {
							"GO" : "a-site_2"
						}
					},
					{
						"NAME"   : "остаться",
						"EFFECT" : {
							"GO" : "stay-on-short"
						}
					},
					{
						"NAME"   : "MIDDLE",
						"EFFECT" : {
							"GO" : "middle_2"
						}
					}
				]
			},
			"stay-on-short" : {
				"DESCRIPTION" : "Вы решили остаться на той же позиции. Это привело к полному захвату точки А, а также вашей смерти из-за отсутсвия активных действии в данный момент.\n\nКоманда соперников обыгрывает вас на доп. раундах и забирает себе приз в виде 5 сертификатов 'CEPP' (Сертифицированный эксперт по программированию на Python).\nСпасибо за игру! ;)",
				"comment to dev" : "надо на точке А сделать условие с гранатами - WIN"
			},
			"a-site_2" : {
				"DESCRIPTION" : "Вы решили вернуться к точке А, вам придется принять неравный бой и выиграть немного времени для ваших союзников.\n\nЧто вы сделаете?",
				"ACTIONS" : [
					{
						"NAME"   : "дать бой",
						"EFFECT" : {
							"GO" : "a-site_bad_end"
						}
					},
					{
						"NAME"   : "использовать гранаты",
						"WHEN"   : {
							"HAVE": "grenades"
						},
						"EFFECT" : {
							"ALERT" : "Вы использовали гранаты",
							"DISPOSE" : "grenades",
							"GO" : "a-site_good_end"
						}
					}
				]
			},
			"a-site_bad_end"  : {
				"DESCRIPTION" : "Вы приняли неравный бой, из-за спешки к вам на помощь ваш союзник погиб ничего не сделав, вам же получилось сделать размен 1:1, оставив своего последнего союзника в ситуации 1v3.\nК сожалению, у него просто не было шансов."
			},
			"a-site_good_end" : {
				"DESCRIPTION" : "Вы использовали гранаты с максимальной пользой, выиграв достаточно времени ваши союзники пришли к вам на помощь.\nБлагодаря преимуществу позиции с вашей стороны и серии разменов вы смогли одержать вверх!\n\nПоздравляю с победой!"
			},
			"middle_2" : {
				"DESCRIPTION" : "Вы решили пойти на 'MIDDLE', вы сразу же встретились со своим союзником, который торопился к вам на помощь, с ним вы можете обойти соперника в спину или же принять бой в кроссфайре (с англ. — «перекрёстный огонь»).\n\nЧто же вы сделаете?",
				"ACTIONS" : [
					{
						"NAME"   : "пойти в спину",
						"EFFECT" : {
							"GO" : "behind_end"
						}
					},
					{
						"NAME"   : "принять бой",
						"EFFECT" : {
							"GO" : "good_end"
						}
					}
				]
			},
			"behind_end" : {
				"DESCRIPTION" : "Это был ваш хитрый план, который мог бы перевернуть игру, но когда вы оказываетесь в спине у врага, вас убивают в спину и вы слышите крик вашего союзника на весь игровой зал:\n- КРЫЫЫЫСААААА!!!\n\nК сожалению, вы проигрываете турнир и возвращаетесь домой ни с чем."
			},
			"good_end" : {
				"DESCRIPTION" : "Благодаря преимуществу позиции с вашей стороны и серии разменов вы смогли одержать вверх!\n\nПоздравляю с победой!"
			},
			"middle" : {
				"DESCRIPTION" : "Оказавшись на миду перед вами нарисована картина:\nУ вашего партнера по команде сверкают пятки и он торопится скорее прийти на точку Б, второй же стоит с AWP и смотрит проход в 'SHORT'\n\nЧто же вы предпримите?",
				"ACTIONS" : [
					{
						"NAME"   : "пойти на Б",
						"EFFECT" : {
							"GO" : "mid_end"
						}
					},
					{
						"NAME"   : "пойти в тёмную",
						"EFFECT" : {
							"GO" : "tunnel_end"
						}
					},
					{
						"NAME"   : "спеть песенку",
						"EFFECT" : {
							"GO" : "b-site"
						}
					}
				]
			},
			"mid_end" : {
				"DESCRIPTION" : "Это было довольно быстро.\n\nВы захотели пройти через 'MIDDLE' на точку Б, но забыли об одной детали - щель в дверях. Через эту щель вам прилетает пуля в голову, а противники получают всю нужную информацию, что бы выиграть раунд.\n\nК сожалению, это самый реалистичный сценарий в этой суровой игре."
			},
			"tunnel_end" : {
				"DESCRIPTION" : "Вы попали под горячую руку, в этом раунде противники затеяли задавить толпой одну точку, но увидев вас - вся их сила направилась в вашу сторону.\n\nПодарив соперникам свое оружие, вы также подарили им возможность выиграть этот раунд, с чем они справились.\nКоманда соперников побеждает, а вы отправляетесь домой :("
			},
			"b-site" : {
				"DESCRIPTION" : "Не успев дойти до точки, вы уже слышите топот нескольких человек, ваш союзник в панике!\nПо ощущениям, из туннеля доносился звук топота десятков людей!\n\nЧто вы сделаете оказавшись в этой ситуации?",
				"ACTIONS" : [
					{
						"NAME"   : "принять бой",
						"EFFECT" : {
							"GO" : "b-site_end"
						}
					},
					{
						"NAME"   : "кинуть гранату",
						"WHEN"   : {
							"HAVE": "grenades"
						},
						"EFFECT" : {
							"ALERT" : "Вы использовали гранату",
							"DISPOSE" : "grenades",
							"GO" : "b-site_good_end"
						}
					}
				]
			},
			"b-site_end" : {
				"DESCRIPTION" : "Будучи не подготовив ничего, по ваш прошлись 5 человек.\nЭто был стандартный и многим запоминающийся своей кровопролитостью 'PUSH B'.\n\nБез гранат вряд ли бы получилось остановить такое..."
			},
			"b-site_good_end" : {
				"DESCRIPTION" : "Хоть топот и внушал страх, вы не растерялись и бросили в туннель гранату.\nЧерез секунду же выбежали все игроки команды соперников. Граната сработала настолько хорошо, что те растерялись и были для вас легкой мишенью. После такого им долго будет снится этот раунд в кошмарах...\n\n Вы победили в этом раунде, в этой матче и в этой игре.\nСпасибо за игру!"
			}
    }
}
