{
	"game_info": {
		"NAME"    : "Колобок",
		"VERSION" : "1.0",
		"AUTHOR"  : "Vitaly N."
	},
	"game": {
			"SCENE_0" : {
				"DESCRIPTION"  : "Жили-были старик со старухой. Вот и говорит старик старухе:\n  — Поди-ка, старуха, по коробу поскреби, по сусеку помети, не наскребешь ли муки на колобок.\nВзяла старуха веничек, по коробу поскребла, по сусеку помела и наскребла муки горсти две. Замесила муку на сметане, состряпала колобок, изжарила в масле и на окошко студить положила, рядом со столовыми приборами.",

				"ACTIONS" : [
				{
					"NAME"   : "уйти от бабушки",
					"EFFECT" : {
						"GO" : "Zayats"
					}
				},
				{
					"NAME"   : "взять вилку и нож",
					"WHEN"   : {
						"LACK"   : "вилка и нож",
						"MISSED" : "Zayats"
					},
					"EFFECT" : {
						"COLLECT" : "вилка и нож",
						"ALERT"   : "Теперь у тебя есть вилка и нож"
					}
				}
				]
			},


			"Zayats" : {
				"DESCRIPTION"  : "Колобок полежал, полежал, взял да и покатился — с окна на лавку, с лавки на пол, пó полу к двери, прыг через порог — да в сени, из сеней на крыльцо, с крыльца на двор, со двора за ворота, дальше и дальше.\nКатится Колобок по дороге, навстречу ему Заяц:\n  — Колобок, Колобок, я тебя съем!",

				"ACTIONS" : [
				{
					"NAME"   : "покатиться назад",
					"EFFECT" : {
						"GO" : "SCENE_0"
					}
				},
				{
					"NAME"   : "спеть песенку",
					"EFFECT" : {
						"GO" : "Volk"
					}
				},
				{
					"NAME"   : "съесть зайца",
					"WHEN"   : {
						"HAVE"  : "вилка и нож"
					},
					"EFFECT" : {
						"ALERT" : "Колобок слишком маленький, чтобы съесть зайца :)"
					}
				}
				]
			},


			"Volk"  : {
				"DESCRIPTION"  : "Спел песенку и покатился дальше по дороге — только Заяц его и видел! Катится Колобок, навстречу ему Волк:\n  — Колобок, Колобок, я тебя съем!",

				"ACTIONS" : [
				{
					"NAME"   : "покатиться назад",
					"EFFECT" : {
						"GO" : "Zayats"
					}
				},
				{
					"NAME"   : "спеть песенку",
					"EFFECT" : {
						"GO" : "Medved"
					}
				},
				{
					"NAME"   : "предложить съесть зайца",
					"WHEN"   : {
						"HAVE"  : "вилка и нож"
					},
					"EFFECT" : {
						"ALERT" : "Вы с Волком пошли к Зайцу и вместе его съели.",
						"DISPOSE" : "вилка и нож",
						"GO" : "Medved"
					}	
				}
				]
			},

			"Medved"  : {
				"DESCRIPTION"  : "И покатился по дороге — только Волк его и видел! Катится Колобок, навстречу ему Медведь:\n  — Колобок, Колобок, я тебя съем!\n  — Где тебе, косолапому, съесть меня!\n Я Колобок, Колобок, Я по коробу скребен, По сусеку метен, На сметане мешон Да в масле пряжон, На окошке стужон. Я от дедушки ушел, Я от бабушки ушел, Я от зайца ушел, Я от волка ушел, От тебя, медведь, подавно уйду!\n И опять покатился — только Медведь его и видел!\n\nКатится Колобок, навстречу ему Лиса:\n  — Колобок, Колобок, куда катишься?\n  — Качусь по дорожке.\n  — Колобок, Колобок, спой мне песенку!\nКолобок и запел:\nЯ Колобок, Колобок, Я по коробу скребен, По сусеку метен, На сметане мешон, Да в масле пряжон, На окошке стужон. Я от дедушки ушел, Я от бабушки ушел, Я от зайца ушел, Я от волка ушел, От медведя ушел, От тебя, лисы, нехитро уйти!\nА Лиса говорит:\n  — Ах, песенка хороша, да слышу я плохо. Колобок, Колобок, сядь ко мне на носок да спой еще разок, погромче.\nКолобок вскочил Лисе на нос и запел погромче ту же песенку. А Лиса опять ему:\n  — Колобок, Колобок, сядь ко мне на язычок да пропой в последний разок.\n Колобок прыг Лисе на язык, а Лиса его — гам! — и съела. Вот и сказке Колобок конец, а кто играл - молодец!",

				"#comment": "Нет поля ACTIONS, значит конец игры"

			}
		}
}
